<template>
     <div class="bg-white">
        <div class="max-w-2xl mx-auto pt-8 lg:pt-16 py-16 px-4 sm:py-24 sm:px-6 lg:max-w-7xl lg:px-8">
        <div class="grid lg:grid-cols-2 grid-cols-1 lg:gap-y-0 gap-y-8 ">
            <div>
                       <div class="w-auto  flex flex-col sm:flex-row-reverse gap-3 items-center justify-center">
                            <div class="img-responsive w-full h-full object-center object-cover sm:rounded-lg flex-[0.8] active"
                                id="image2">
                                <img class="main-image img-responsive w-full h-full object-center object-cover sm:rounded-lg"
                                    onerror="this.src='{{ asset('assets/front-end/img/image-place-holder.png') }}'"
                                    src="../../assets/Icons/iphoneProduct.png"
                                      alt="Product image"
                                    width="">
                                <div class="cz-image-zoom-pane"></div>
                            </div>
                        <div class="flex sm:flex-col flex-row gap-x-2 flex-[0.2]">
                                    <a class="stop-link img-anchor w-full  object-center object-cover sm:rounded-lg mb-2"
                                        href="#image{{ $key }}">
                                        <img
                                            src='../../assets/Icons/iphoneProduct.png' alt="Product thumb"
                                            class="w-full h-full object-center object-cover sm:rounded-lg mb-2" />
                                    </a>
                                    <a class="stop-link img-anchor w-full  object-center object-cover sm:rounded-lg mb-2"
                                        href="#image{{ $key }}">
                                        <img
                                            src='../../assets/Icons/iphoneProduct.png' alt="Product thumb"
                                            class="w-full h-full object-center object-cover sm:rounded-lg mb-2" />
                                    </a>
                                                 <a class="stop-link img-anchor w-full  object-center object-cover sm:rounded-lg mb-2"
                                        href="#image{{ $key }}">
                                         <!-- onerror="this.src='{{ asset('assets/front-end/img/image-place-holder.png') }}'" -->
                                        <img
                                            src='../../assets/Icons/iphoneProduct.png' alt="Product thumb"
                                            class="w-full h-full object-center object-cover sm:rounded-lg mb-2" />
                                    </a>
                                                 <a class="stop-link img-anchor w-full  object-center object-cover sm:rounded-lg mb-2"
                                        href="#image{{ $key }}">
                                         <!-- onerror="this.src='{{ asset('assets/front-end/img/image-place-holder.png') }}'" -->
                                        <img
                                            src='../../assets/Icons/iphoneProduct.png' alt="Product thumb"
                                            class="w-full h-full object-center object-cover sm:rounded-lg mb-2" />
                                    </a>
                                <!-- @endforeach -->
                            <!-- @endif -->
                        </div>
                    </div>
                    <p class="font-FlatBold text-[12px] text-right mx-8 ">هل لديك سؤال؟
                        <span class="text-[#0156FF] font-FlatBold text-[12px]">اتصل بنا</span>
                    </p>
                    <ul class="flex flex-row-reverse gap-x-10 mt-9 mx-8">
                        <li class="relative font-FlatBold text-[12px] sm:text-[17px] text-[#171515] ">
                           وصف المنتج      
                        <div class="absolute w-full border-b-[3px] border-b-[#0156FF] rounded-[20px] top-8">
                        </div>
                        </li>
                        <li class="font-FlatBold text-[12px] sm:text-[17px] text-[#A3A3A3]">
                            <a href="#">
                                محتويات العلبه
                                </a> 
                                </li>
                        <li class="font-FlatBold text-[12px] sm:text-[17px] text-[#A3A3A3]">
                                <a href="#">
                                 كفالة
                                </a> 
                             </li>
                    </ul>
                    <p class="pt-8 text-right mx-8 font-Flatnormal text-[16px]">
                        iPhone 13 & iPhone 13 Mini
                        <br/>
نظام الكاميرا المزدوجه الأكثر تطورا في iPhone على الاطلاق
                        <br/>
شريحة A15 Bioic فائقة السرعة
                        <br/>
قفزة نوعيه في عمر البطارية
                        <br/>
تصميم كله متانه
                        <br/>
فائقة السرعه 5G 
                        <br/>
شاشة Super Retina XDR اكثر سطوعا بمقياسها 6.1 أنش و 5.4 أنش
</p>
                    </div>
            <div class="bg-[#F5F7FF] pt-12 pb-7 px-20">
                <p class="text-[17px] md:text-[30px] font-FlatBold md:font-Poppins text-right">iPhone 13 & iPhone 13 mini</p>
                <div class="flex flex-row flex-wrap-reverse gap-y-4 lg:gap-y-0 items-center justify-end">
                    <p class="text-[12px] font-FlatBold text-[#0156FF] pr-2">(24 تعليقات)</p>
                    <div class="flex flex-row gap-x-1 pr-2">
                    <img src="../../assets/Icons/ProductUncolorStar.svg" alt="">
                    <img src="../../assets/Icons/ProductUncolorStar.svg" alt="">
                    <img src="../../assets/Icons/ProductStar.svg" alt="">
                    <img src="../../assets/Icons/ProductStar.svg" alt="">
                    </div>
                    <p class="text-[12px] font-Poppins ">SKU D5515A</p>
                </div>
                <div class="flex flex-row-reverse flex-wrap gap-y-4 lg:gap-y-0 items-center justify-start gap-x-1 border-b-2 pb-4 border-b-[#CACDD8]">
                <p class="font-FlatBold text-[14px]">للبيع من</p>
                <p class="font-FlatBold text-[14px] text-[#0156FF]">₪3299.00</p>
                <div class="relative font-FlatBold text-[14px] text-[#666666]">
                ₪499.00
                <div class="w-14 top-2.5 border-b-2 border-b-[#666666] absolute"></div>
                </div>
                <p dir="rtl" class="font-Flatnormal text-[12px] text-[#0156FF]">خصومات تصل الى 30%</p>
                </div>
                <p class="font-Flatnormal text-[14px] mt-4 text-justify md:text-right">Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled </p>
<!-- size -->
<p class="font-FlatBold text-[16px] text-[#171515] text-center md:text-right pt-7 pb-2">اختر السعه</p>
<div class="flex flex-row-reverse flex-wrap items-center justify-center gap-y-3 lg:gap-y-0 lg:justify-start gap-x-2"> 
<button type="button" class="flex justify-center items-center px-6 py-3 min-w-[140px] min-h-[85px] border border-[#CACDD8]
font-Flatnormal text-[14px] rounded-[20px] text-gray-700 bg-transparent hover:border-[#0156FF] ">128 GB</button>
<button type="button" class="flex justify-center items-center px-6 py-3 min-w-[140px] min-h-[85px] border border-[#CACDD8]
font-Flatnormal text-[14px] rounded-[20px] text-gray-700 bg-transparent hover:border-[#0156FF] ">128 GB</button>
<button type="button" class="flex justify-center items-center px-6 py-3 min-w-[140px] min-h-[85px] border border-[#CACDD8]
font-Flatnormal text-[14px] rounded-[20px] text-gray-700 bg-transparent hover:border-[#0156FF] ">128 GB</button>
</div>
<!-- Color -->
<p class="font-FlatBold text-[16px] text-[#171515] text-center md:text-right pt-7 pb-2 ">اختر الالوان</p>
<div class="flex flex-row-reverse flex-wrap gap-y-2 items-center lg:justify-start justify-center gap-x-2"> 
<button type="button" class="flex justify-center items-center px-6 py-3 min-w-[140px] min-h-[85px] border border-[#CACDD8]
font-Flatnormal text-[14px] rounded-[20px] text-gray-700 bg-transparent hover:border-[#0156FF] ">
         <label class="-m-0.5 relative p-0.5 rounded-full flex items-center justify-center cursor-pointer focus:outline-none ring-gray-900">
         <input type="radio" name="color-choice" value="Black" class="sr-only" aria-labelledby="color-choice-0-label">
         <p id="color-choice-0-label" class="sr-only">Black</p>
        <span aria-hidden="true" class="h-8 w-8 bg-[#C4C4C4] border border-black border-opacity-10 rounded-full"></span>
        </label>
</button>
<button type="button" class="flex justify-center items-center px-6 py-3 min-w-[140px] min-h-[85px] border border-[#CACDD8]
font-Flatnormal text-[14px] rounded-[20px] text-gray-700 bg-transparent hover:border-[#0156FF] ">
         <label class="-m-0.5 relative p-0.5 rounded-full flex items-center justify-center cursor-pointer focus:outline-none ring-gray-900">
        <input type="radio" name="color-choice" value="Black" class="sr-only" aria-labelledby="color-choice-0-label">
        <p id="color-choice-0-label" class="sr-only">Black</p>
        <span aria-hidden="true" class="h-8 w-8 bg-[#8FA1B9] border border-black border-opacity-10 rounded-full"></span>
        </label>
</button>
<button type="button" class="flex justify-center items-center px-6 py-3 min-w-[140px] min-h-[85px] border border-[#CACDD8]
font-Flatnormal text-[14px] rounded-[20px] text-gray-700 bg-transparent hover:border-[#0156FF] ">
         <label class="-m-0.5 relative p-0.5 rounded-full flex items-center justify-center cursor-pointer focus:outline-none ring-gray-900">
        <input type="radio" name="color-choice" value="Black" class="sr-only" aria-labelledby="color-choice-0-label">
        <p id="color-choice-0-label" class="sr-only">Black</p>
        <span aria-hidden="true" class="h-8 w-8 bg-[#5D9E56] border border-black border-opacity-10 rounded-full"></span>
        </label>
</button>
<button type="button" class="flex justify-center items-center px-6 py-3 min-w-[140px] min-h-[85px] border border-[#CACDD8]
font-Flatnormal text-[14px] rounded-[20px] text-gray-700 bg-transparent hover:border-[#0156FF] ">
         <label class="-m-0.5 relative p-0.5 rounded-full flex items-center justify-center cursor-pointer focus:outline-none ring-gray-900">
        <input type="radio" name="color-choice" value="Black" class="sr-only" aria-labelledby="color-choice-0-label">
        <p id="color-choice-0-label" class="sr-only">Black</p>
        <span aria-hidden="true" class="h-8 w-8 bg-[#FFE3D3] border border-black border-opacity-10 rounded-full"></span>
        </label>
</button>
<button type="button" class="flex justify-center items-center px-6 py-3 min-w-[140px] min-h-[85px] border border-[#CACDD8]
font-Flatnormal text-[14px] rounded-[20px] text-gray-700 bg-transparent hover:border-[#0156FF] ">
         <label class="-m-0.5 relative p-0.5 rounded-full flex items-center justify-center cursor-pointer focus:outline-none ring-gray-900">
        <input type="radio" name="color-choice" value="Black" class="sr-only" aria-labelledby="color-choice-0-label">
        <p id="color-choice-0-label" class="sr-only">Black</p>
        <span aria-hidden="true" class="h-8 w-8 bg-[#BECFF9] border border-black border-opacity-10 rounded-full"></span>
        </label>
</button>
</div>
<!-- Number -->
<p class="font-FlatBold text-[16px] text-[#171515] text-center md:text-right pt-7 pb-2 ">اختر العدد</p>
                     <div dir="rtl" class="flex items-center  sm:flex justify-center md:justify-start rounded-[20px] min-w-[140px] min-h-[85px] sm:text-center">
                  <select id="quantity-0" name="quantity-0" class="block bg-transparent max-w-full rounded-md border py-6 px-8 text-base leading-5  text-left sm:text-sm hover:border-[#0156FF]">
                    <option value="1">1</option>
                    <option value="2">2</option>
                    <option value="3">3</option>
                    <option value="4">4</option>
                    <option value="5">5</option>
                    <option value="6">6</option>
                    <option value="7">7</option>
                    <option value="8">8</option>
                  </select>
                </div>
                <div class="mt-10 flex flex-row items-center justify-between sm:flex-col1">
                    <button onclick="addWishlist('2')" type="button"
                        class="add-favorit py-2 px-3 rounded-[20px] md:rounded-[50px] auto md:min-w-[110px] text-[#0156FF] min-h-[60px] border border-[#0156FF] duration-200 flex items-center justify-center hover:bg-gray-100 hover:text-gray-500">
                                <svg xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke-width="2"
                                    stroke="currentColor" aria-hidden="true" class="duration-200 h-8 w-8 flex-shrink-0">
                                    <path stroke-linecap="round" stroke-linejoin="round"
                                        d="M4.318 6.318a4.5 4.5 0 000 6.364L12 20.364l7.682-7.682a4.5 4.5 0 00-6.364-6.364L12 7.636l-1.318-1.318a4.5 4.5 0 00-6.364 0z">
                                    </path>
                                </svg>
                            </button>
                            <button type="button" onclick="addToCart()"
                class=" bg-transparent text-[#0156FF]  min-h-[60px]  border border-[#0156FF] rounded-[20px] md:rounded-[50px] hover:bg-[#0156FF]
                hover:text-white hover:border-0 pb-3 pt-4 px-0 sm:px-24 lg:px-16 w-[80%] text-[14px] font-FlatBold ml-2 flex 
                items-center justify-center  duration-200">
                                أضف الى الحقيبة </button>
                        </div>
                         <div class="flex items-end justify-center"><button type="button" onclick="buy_now()"
                                class="max-w-screen-xl min-h-[60px] bg-[#0156FF] mt-2 text-white  md:text-[14px] font-FlatBold rounded-[50px] hover:bg-black hover:text-white pb-3 pt-4 w-full flex items-center justify-center  duration-200">
                                أشتري الان </button></div>
                               
                               <!-- services -->
                                <div class="mt-7 border border-[#CACDD8] rounded-[6px]">
                                <div class="flex flex-col items-end p-4">
                                <div class="flex flex-row justify-end items-center w-full">
                                    <div class="text-right cursor-pointer w-full">
                                        <div class="flex flex-row-reverse items-center justify-between">
                                        <h3 class="text-[#171515] text-[12px] md:text-[16px] font-FlatBold  ">شحن مجاني</h3>
                                         <svg class="duration-300" xmlns="http://www.w3.org/2000/svg" width="12"
                                            height="10" viewBox="0 0 17 11" fill="none">
                                            <path
                                                d="M16.1799 10.1577H0.820002C0.0931492 10.1577 -0.277135 9.28 0.244006 8.75885L7.92396 1.07883C8.23939 0.763406 8.76053 0.763406 9.07609 1.07883L16.7561 8.75885C17.2771 9.28 16.9068 10.1577 16.1799 10.1577Z"
                                                fill="#201A3C" />
                                        </svg>
                                        </div>
                                        <h6 class="text-[#313131] text-[12px] md:text-[14px] text-right font-Flatnormal">
                                            تاريخ سريع مجاني للطلبات أكثر من تاريخ التوصيل المحتمل في 13-04-2022

                                        </h6>
                                    </div>
                                    <div>
     <svg class="ml-2" width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
<g clip-path="url(#clip0_124_811)">
<path d="M9.89173 18.8031C10.6577 18.089 10.7757 16.9706 10.1552 16.305C9.5347 15.6394 8.41074 15.6786 7.64475 16.3927C6.87877 17.1067 6.76082 18.2251 7.3813 18.8908C8.00179 19.5564 9.12574 19.5171 9.89173 18.8031Z" fill="#0156FF"/>
<path d="M20.027 18.8041C20.793 18.09 20.9109 16.9716 20.2904 16.306C19.67 15.6403 18.546 15.6796 17.78 16.3936C17.014 17.1077 16.8961 18.2261 17.5166 18.8917C18.137 19.5574 19.261 19.5181 20.027 18.8041Z" fill="#0156FF"/>
<path d="M1.85444 10.0641C1.85444 9.62202 1.4961 9.26367 1.05405 9.26367C0.612009 9.26367 0.253662 9.62202 0.253662 10.0641C0.253662 10.5061 0.612009 10.8645 1.05405 10.8645C1.4961 10.8645 1.85444 10.5061 1.85444 10.0641Z" fill="#0156FF"/>
<path d="M16.2413 17.4303C16.5258 16.0241 17.8542 14.9066 19.282 14.9066C20.6569 14.9066 21.6478 15.943 21.6206 17.2756C23.1075 17.3145 23.5214 15.3566 23.5214 15.3566C23.6466 14.8091 23.8336 13.7417 23.9902 12.6941C24.0415 12.3706 24.0021 12.0393 23.8763 11.7369C23.4876 10.8296 23.0179 9.95917 22.4728 9.13625C21.9572 8.36703 21.0924 7.91141 20.1052 7.895C19.5164 7.88563 18.9385 7.88 18.502 7.88L18.4983 7.87625C18.442 6.935 17.7558 6.21406 16.7925 6.12781C16.1658 6.07203 13.6833 6.03125 12.4917 6.03125C12.0183 6.03125 11.3391 6.03781 10.6519 6.04906V6.04625H10.6463H2.38408C2.27892 6.04619 2.17479 6.06685 2.07762 6.10707C1.98046 6.14728 1.89217 6.20625 1.81782 6.28061C1.74346 6.35497 1.68449 6.44325 1.64428 6.54042C1.60406 6.63758 1.5834 6.74172 1.58346 6.84688V6.85063C1.58346 7.06197 1.66741 7.26466 1.81686 7.4141C1.9663 7.56354 2.16899 7.6475 2.38033 7.6475H4.0458C4.24634 7.66229 4.43388 7.75234 4.57081 7.89961C4.70773 8.04688 4.78392 8.24047 4.78408 8.44156V8.44578C4.78439 8.55104 4.76394 8.65532 4.7239 8.75267C4.68386 8.85002 4.62502 8.93851 4.55075 9.01309C4.47647 9.08767 4.38822 9.14688 4.29103 9.18731C4.19385 9.22775 4.08965 9.24863 3.98439 9.24875H3.13033C2.91812 9.24875 2.71459 9.33305 2.56454 9.48311C2.41448 9.63317 2.33018 9.83669 2.33018 10.0489C2.33011 10.154 2.35077 10.2581 2.39095 10.3553C2.43113 10.4524 2.49006 10.5407 2.56437 10.615C2.63868 10.6894 2.72691 10.7483 2.82402 10.7886C2.92113 10.8288 3.02521 10.8495 3.13033 10.8495H3.98439C4.19673 10.8495 4.40038 10.9339 4.55052 11.084C4.70067 11.2342 4.78502 11.4378 4.78502 11.6502C4.78502 11.8625 4.70067 12.0661 4.55052 12.2163C4.40038 12.3664 4.19673 12.4508 3.98439 12.4508H0.789394C0.577137 12.4508 0.373566 12.5351 0.223433 12.6851C0.0733 12.8352 -0.0111062 13.0387 -0.0112305 13.2509C-0.0112305 13.4633 0.0731208 13.6669 0.223267 13.8171C0.373413 13.9672 0.577056 14.0516 0.789394 14.0516H3.98439C4.19673 14.0516 4.40038 14.1359 4.55052 14.2861C4.70067 14.4362 4.78502 14.6398 4.78502 14.8522C4.78477 15.0644 4.70031 15.2678 4.55019 15.4177C4.40007 15.5677 4.19657 15.6519 3.98439 15.6519H2.99627C2.78405 15.6519 2.58053 15.7362 2.43047 15.8862C2.28042 16.0363 2.19611 16.2398 2.19611 16.452C2.19611 16.6643 2.2804 16.8679 2.43044 17.018C2.58049 17.1681 2.78401 17.2525 2.99627 17.2527L6.14908 17.2503L6.41111 16.5973C6.94783 15.6073 8.01564 14.9061 9.14627 14.9061C10.5745 14.9061 11.5889 16.0245 11.4774 17.4317H16.2408L16.2413 17.4303ZM8.30018 9.62141H7.2258C7.22478 9.62149 7.22382 9.6219 7.22306 9.62257C7.2223 9.62325 7.22178 9.62416 7.22158 9.62516L7.12268 10.3283C7.12253 10.3288 7.12252 10.3294 7.12264 10.33C7.12276 10.3306 7.12301 10.3311 7.12338 10.3316C7.12374 10.332 7.12421 10.3324 7.12474 10.3326C7.12526 10.3329 7.12584 10.333 7.12643 10.333H7.92611C7.96536 10.3319 8.00437 10.3395 8.04029 10.3554C8.07621 10.3713 8.10813 10.3949 8.13373 10.4247C8.15933 10.4545 8.17796 10.4896 8.18826 10.5275C8.19857 10.5654 8.20029 10.6051 8.1933 10.6437C8.1796 10.7287 8.13671 10.8062 8.07203 10.8629C8.00735 10.9196 7.92492 10.952 7.83893 10.9545H7.0383C7.03733 10.9545 7.03637 10.9548 7.0356 10.9554C7.03484 10.956 7.0343 10.9569 7.03408 10.9578L6.89064 11.9792C6.87694 12.0642 6.83406 12.1417 6.76938 12.1984C6.7047 12.2551 6.62226 12.2875 6.53627 12.29C6.49703 12.2911 6.45804 12.2835 6.42213 12.2676C6.38623 12.2517 6.35433 12.228 6.32877 12.1982C6.3032 12.1685 6.28462 12.1333 6.27437 12.0954C6.26413 12.0575 6.26248 12.0178 6.26955 11.9792L6.64174 9.32984C6.65649 9.24014 6.70196 9.15836 6.77037 9.0985C6.83878 9.03864 6.92588 9.00443 7.01674 9.00172H8.38689C8.42613 9.00059 8.46513 9.00824 8.50103 9.02412C8.53693 9.03999 8.56883 9.06369 8.59439 9.09348C8.61996 9.12327 8.63855 9.15839 8.64879 9.19629C8.65904 9.23418 8.66068 9.27389 8.65361 9.3125C8.63972 9.39701 8.59685 9.47406 8.53236 9.53042C8.46788 9.58678 8.38579 9.61895 8.30018 9.62141ZM11.1717 9.21266C11.2834 9.31168 11.3619 9.44257 11.3967 9.58766C11.4357 9.75201 11.4421 9.92241 11.4155 10.0892C11.3829 10.3488 11.2767 10.5936 11.1094 10.7947C11.0072 10.9155 10.8775 11.0099 10.7311 11.0698C10.7305 11.0705 10.7301 11.0715 10.7301 11.0724C10.7301 11.0734 10.7305 11.0743 10.7311 11.075L10.9974 11.8433C11.0691 12.0495 10.8849 12.29 10.6556 12.29H10.6406C10.585 12.2916 10.5303 12.2755 10.4845 12.244C10.4387 12.2125 10.404 12.1672 10.3856 12.1147L10.0636 11.1772C10.0632 11.1765 10.0625 11.1759 10.0618 11.1755C10.0611 11.1751 10.0602 11.1749 10.0594 11.1748H9.37502C9.37407 11.1749 9.37315 11.1752 9.3724 11.1758C9.37164 11.1764 9.37109 11.1772 9.3708 11.1781L9.2583 11.9787C9.2446 12.0637 9.20172 12.1412 9.13703 12.1979C9.07235 12.2546 8.98992 12.287 8.90392 12.2895C8.86469 12.2907 8.82569 12.283 8.78979 12.2671C8.75389 12.2513 8.72199 12.2276 8.69642 12.1978C8.67086 12.168 8.65227 12.1329 8.64203 12.095C8.63178 12.0571 8.63014 12.0174 8.63721 11.9787L9.00939 9.32937C9.02414 9.23968 9.06961 9.15789 9.13803 9.09803C9.20644 9.03817 9.29353 9.00396 9.38439 9.00125H10.4438C10.4438 9.00125 10.9088 8.98672 11.1717 9.21266ZM14.0874 9.29047C14.0746 9.3698 14.0346 9.4422 13.9742 9.49517C13.9138 9.54814 13.8367 9.57837 13.7564 9.58062H12.5241C12.5231 9.58068 12.5222 9.58102 12.5215 9.5816C12.5207 9.58219 12.5201 9.58299 12.5199 9.58391L12.4219 10.2795C12.4217 10.2801 12.4217 10.2807 12.4219 10.2813C12.422 10.2818 12.4222 10.2824 12.4226 10.2828C12.423 10.2833 12.4234 10.2836 12.424 10.2839C12.4245 10.2841 12.4251 10.2842 12.4256 10.2842H13.3828C13.4195 10.2831 13.4559 10.2903 13.4895 10.3051C13.523 10.3199 13.5528 10.342 13.5767 10.3698C13.6006 10.3976 13.618 10.4304 13.6276 10.4658C13.6372 10.5012 13.6388 10.5383 13.6322 10.5744C13.6195 10.6537 13.5794 10.7261 13.519 10.7791C13.4586 10.832 13.3816 10.8623 13.3013 10.8645H12.3436C12.3427 10.8646 12.3417 10.8649 12.341 10.8655C12.3402 10.8661 12.3397 10.8669 12.3394 10.8678L12.2217 11.705C12.2217 11.7062 12.2222 11.7073 12.2229 11.7082C12.2237 11.709 12.2248 11.7096 12.226 11.7097H13.4574C13.494 11.7086 13.5305 11.7157 13.564 11.7305C13.5976 11.7453 13.6274 11.7675 13.6513 11.7953C13.6752 11.8231 13.6926 11.8559 13.7022 11.8913C13.7118 11.9267 13.7133 11.9638 13.7067 11.9998C13.694 12.0792 13.654 12.1516 13.5935 12.2045C13.5331 12.2575 13.4561 12.2877 13.3758 12.29H11.8477C11.8064 12.2906 11.7656 12.2821 11.728 12.2651C11.6904 12.2481 11.657 12.2231 11.6302 12.1918C11.6034 12.1605 11.5837 12.1237 11.5727 12.0839C11.5617 12.0442 11.5595 12.0025 11.5664 11.9619L11.9363 9.33125C11.951 9.24155 11.9965 9.15977 12.0649 9.09991C12.1333 9.04005 12.2204 9.00584 12.3113 9.00312H13.8389C13.8752 9.00226 13.9113 9.00944 13.9445 9.02415C13.9776 9.03886 14.0072 9.06073 14.0309 9.08819C14.0547 9.11566 14.072 9.14804 14.0818 9.18301C14.0916 9.21798 14.0935 9.25468 14.0874 9.29047ZM16.6472 9.29047C16.6345 9.3698 16.5944 9.4422 16.534 9.49517C16.4736 9.54814 16.3966 9.57837 16.3163 9.58062H15.0839C15.083 9.58068 15.0821 9.58102 15.0813 9.5816C15.0805 9.58219 15.08 9.58299 15.0797 9.58391L14.9822 10.2795C14.9821 10.2801 14.982 10.2807 14.9822 10.2813C14.9823 10.2818 14.9825 10.2824 14.9829 10.2828C14.9833 10.2833 14.9837 10.2836 14.9843 10.2839C14.9848 10.2841 14.9854 10.2842 14.986 10.2842H15.9431C15.9798 10.2831 16.0162 10.2903 16.0498 10.3051C16.0833 10.3199 16.1132 10.342 16.1371 10.3698C16.161 10.3976 16.1783 10.4304 16.1879 10.4658C16.1975 10.5012 16.1991 10.5383 16.1925 10.5744C16.1798 10.6537 16.1397 10.7261 16.0793 10.7791C16.0189 10.832 15.9419 10.8623 15.8616 10.8645H14.9035C14.9025 10.8646 14.9016 10.8649 14.9008 10.8655C14.9001 10.8661 14.8995 10.8669 14.8992 10.8678L14.7816 11.705C14.7816 11.7062 14.782 11.7073 14.7828 11.7082C14.7836 11.709 14.7846 11.7096 14.7858 11.7097H16.0172C16.0539 11.7086 16.0903 11.7157 16.1238 11.7305C16.1574 11.7453 16.1872 11.7675 16.2111 11.7953C16.235 11.8231 16.2524 11.8559 16.262 11.8913C16.2716 11.9267 16.2732 11.9638 16.2666 11.9998C16.2538 12.0792 16.2138 12.1516 16.1534 12.2045C16.093 12.2575 16.016 12.2877 15.9356 12.29H14.4075C14.3663 12.2906 14.3254 12.2821 14.2878 12.2651C14.2503 12.2481 14.2169 12.2231 14.19 12.1918C14.1632 12.1605 14.1436 12.1237 14.1326 12.0839C14.1215 12.0442 14.1194 12.0025 14.1263 11.9619L14.4961 9.33125C14.5109 9.24155 14.5563 9.15977 14.6247 9.09991C14.6932 9.04005 14.7802 9.00584 14.8711 9.00312H16.3988C16.4351 9.00226 16.4711 9.00944 16.5043 9.02415C16.5375 9.03886 16.567 9.06073 16.5908 9.08819C16.6145 9.11566 16.6319 9.14804 16.6416 9.18301C16.6514 9.21798 16.6533 9.25468 16.6472 9.29047ZM18.4285 8.99C18.847 8.99 19.3889 8.99562 19.9327 9.00453C20.5917 9.01531 21.1683 9.31812 21.5142 9.83469C21.8837 10.3917 22.2159 10.9727 22.5085 11.5737C22.6631 11.8887 22.3786 12.2989 22.006 12.2989H18.0099L18.4285 8.99Z" fill="#0156FF"/>
<path d="M10.193 10.5959H9.45239L9.59302 9.58152H10.3332C10.3332 9.58152 10.8765 9.54636 10.7874 10.0887C10.7897 10.0887 10.7274 10.5959 10.193 10.5959Z" fill="#0156FF"/>
</g>
<defs>
<clipPath id="clip0_124_811">
<rect width="24" height="24" fill="white" transform="translate(0 0.699219)"/>
</clipPath>
</defs>
</svg>

                                    </div>
                                </div>
                            </div>
                                </div>
                            <!-- second Servive -->
                            <div class="mt-2 border border-[#CACDD8] rounded-[6px]">
                                <div class="flex flex-col items-end p-4">
                                <div class="flex flex-row justify-end items-center w-full">
                                    <div class="text-right cursor-pointer w-full">
                                        <div class="flex flex-row-reverse items-center justify-between w-full">
                                        <h3 class="text-[#171515] text-[12px] md:text-[16px]  font-FlatBold  "> خدمة الدفع عند الأستلام</h3>
                                         <svg class="duration-300" xmlns="http://www.w3.org/2000/svg" width="12"
                                            height="11" viewBox="0 0 17 11" fill="none">
                                            <path
                                                d="M16.1799 10.1577H0.820002C0.0931492 10.1577 -0.277135 9.28 0.244006 8.75885L7.92396 1.07883C8.23939 0.763406 8.76053 0.763406 9.07609 1.07883L16.7561 8.75885C17.2771 9.28 16.9068 10.1577 16.1799 10.1577Z"
                                                fill="#201A3C" />
                                        </svg>
                                        </div>
                                        <h6 class="hidden text-[#313131] text-[14px] text-right font-Flatnormal">
                                            تاريخ سريع مجاني للطلبات أكثر من تاريخ التوصيل المحتمل في 13-04-2022

                                        </h6>
                                    </div>
                                    <div>
  <svg class="ml-2" width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
<g clip-path="url(#clip0_124_768)">
<path d="M22.9166 15.1396C21.7361 14.7123 20.4256 14.811 19.3209 15.4104C19.3064 15.4175 14.9955 17.3658 14.9955 17.3658C14.6893 17.5952 14.334 17.7164 13.9682 17.7164H11.2559C10.919 17.7164 10.6458 17.4435 10.6458 17.107C10.6458 16.7705 10.919 16.4977 11.2559 16.4977H13.9682C14.8161 16.4977 14.8347 14.7533 14.0042 14.6842L10.2238 14.6408C9.5567 14.6334 8.88906 14.2046 8.18588 14.1885C7.47019 14.1721 6.79312 14.3547 6.19142 14.7449C5.35358 15.2884 4.78158 16.1519 4.39819 17.0574L6.44353 22.2225H12.3246C12.8554 22.2225 13.3795 22.0832 13.8403 21.8196L22.9673 16.5984C23.2448 16.3631 23.4591 16.0883 23.365 15.6664C23.3119 15.4291 23.1417 15.2212 22.9166 15.1396Z" fill="#0156FF"/>
<path d="M0.612793 17.6904L3.40018 24.7295L5.63756 23.5009L2.85013 16.4619L0.612793 17.6904Z" fill="#0156FF"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M22.6909 7.27527C22.6909 10.4082 20.1511 12.948 17.0182 12.948C13.8852 12.948 11.3455 10.4082 11.3455 7.27527C11.3455 4.14231 13.8852 1.60254 17.0182 1.60254C20.1511 1.60254 22.6909 4.14231 22.6909 7.27527ZM13.9636 9.46552V4.65708H16.2297C17.3254 4.65904 18.2134 5.54703 18.2154 6.64279V7.82677H17.2196V6.71532C17.2196 6.12921 16.7452 5.65288 16.1591 5.65288H14.9594V9.46552H13.9636ZM15.5926 7.48177C15.5926 8.57754 16.4825 9.46552 17.5783 9.46748V9.46552H19.8443V4.65708H18.8485V8.47169H17.6489C17.0628 8.47169 16.5884 7.99731 16.5884 7.4112V6.29779H15.5926V7.48177Z" fill="#0156FF"/>
</g>
<defs>
<clipPath id="clip0_124_768">
<rect width="24" height="24" fill="white" transform="translate(0 0.729492)"/>
</clipPath>
</defs>
</svg>

                                    </div>
                                </div>
                            </div>
                                </div>
                                             <!-- second Servive -->
                            <div class="mt-2 border border-[#CACDD8] rounded-[6px]">
                                <div class="flex flex-col items-end p-4">
                                <div class="flex flex-row justify-end items-center w-full">
                                    <div class="text-right cursor-pointer w-full">
                                        <div class="flex flex-row-reverse items-center justify-between w-full">
                                        <h3 class="text-[#171515] text-[12px] md:text-[16px]  font-FlatBold  "> سياسة الارجاع </h3>
                                         <svg class="duration-300" xmlns="http://www.w3.org/2000/svg" width="12"
                                            height="11" viewBox="0 0 17 11" fill="none">
                                            <path
                                                d="M16.1799 10.1577H0.820002C0.0931492 10.1577 -0.277135 9.28 0.244006 8.75885L7.92396 1.07883C8.23939 0.763406 8.76053 0.763406 9.07609 1.07883L16.7561 8.75885C17.2771 9.28 16.9068 10.1577 16.1799 10.1577Z"
                                                fill="#201A3C" />
                                        </svg>
                                        </div>
                                        <h6 class="hidden text-[#313131] text-[14px] text-right font-Flatnormal">
                                            تاريخ سريع مجاني للطلبات أكثر من تاريخ التوصيل المحتمل في 13-04-2022

                                        </h6>
                                    </div>
                                    <div>
        <svg class="ml-2" width="25" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M1.97985 15.5043C1.88948 15.2142 1.8111 14.9172 1.74604 14.6215C1.72922 14.5496 1.68472 14.4871 1.62218 14.4476C1.55965 14.4082 1.4841 14.395 1.41188 14.4108C1.33967 14.4267 1.2766 14.4703 1.23632 14.5323C1.19604 14.5943 1.1818 14.6697 1.19666 14.7421C1.26491 15.0534 1.3476 15.3659 1.44248 15.6714C1.46463 15.7426 1.51419 15.8022 1.58024 15.8369C1.64629 15.8716 1.72344 15.8787 1.7947 15.8565C1.86596 15.8344 1.9255 15.7848 1.96022 15.7188C1.99494 15.6527 2.00201 15.5756 1.97985 15.5043Z" fill="#0156FF"/>
<path d="M2.66759 17.1931C2.52959 16.9227 2.4019 16.6435 2.28771 16.3632C2.27394 16.3288 2.2535 16.2975 2.22757 16.271C2.20164 16.2445 2.17073 16.2234 2.13662 16.2089C2.10251 16.1944 2.06588 16.1868 2.02882 16.1865C1.99176 16.1862 1.955 16.1933 1.92067 16.2072C1.88634 16.2212 1.85511 16.2418 1.82877 16.2679C1.80242 16.2939 1.7815 16.325 1.76718 16.3592C1.75287 16.3933 1.74545 16.43 1.74536 16.4671C1.74527 16.5041 1.7525 16.5409 1.76665 16.5751C1.88665 16.8704 2.02127 17.1642 2.16659 17.4489C2.18338 17.4818 2.20649 17.511 2.23459 17.535C2.26269 17.5589 2.29524 17.5771 2.33038 17.5885C2.36551 17.5999 2.40255 17.6043 2.43937 17.6013C2.47618 17.5984 2.51207 17.5883 2.54496 17.5715C2.57786 17.5547 2.60712 17.5316 2.63109 17.5035C2.65506 17.4754 2.67325 17.4428 2.68464 17.4077C2.69603 17.3726 2.70038 17.3355 2.69746 17.2987C2.69453 17.2619 2.68438 17.226 2.66759 17.1931Z" fill="#0156FF"/>
<path d="M1.34585 14.0376C1.41979 14.0279 1.48683 13.9891 1.53223 13.93C1.57762 13.8708 1.59765 13.796 1.58791 13.722C1.54816 13.422 1.52079 13.1164 1.50616 12.8121C1.50508 12.775 1.49654 12.7385 1.48103 12.7048C1.46553 12.671 1.44338 12.6408 1.41592 12.6158C1.38846 12.5908 1.35625 12.5717 1.32121 12.5594C1.28617 12.5472 1.24902 12.5421 1.21198 12.5445C1.17508 12.5463 1.13888 12.5553 1.10547 12.571C1.07205 12.5868 1.04206 12.609 1.01722 12.6363C0.992369 12.6636 0.973151 12.6956 0.96066 12.7304C0.948168 12.7651 0.942648 12.802 0.944413 12.8389C0.959601 13.159 0.988476 13.4807 1.0301 13.7952C1.03493 13.8318 1.04693 13.8671 1.06541 13.8991C1.08389 13.9311 1.1085 13.9591 1.13782 13.9816C1.16715 14.0041 1.20061 14.0206 1.2363 14.0301C1.272 14.0397 1.30922 14.0421 1.34585 14.0372V14.0376Z" fill="#0156FF"/>
<path d="M3.11632 17.9892C3.09721 17.957 3.07187 17.929 3.0418 17.9067C3.01172 17.8845 2.9775 17.8684 2.94115 17.8596C2.9048 17.8507 2.86704 17.8492 2.8301 17.8551C2.79315 17.861 2.75775 17.8742 2.72598 17.894C2.69421 17.9137 2.6667 17.9396 2.64506 17.9702C2.62342 18.0007 2.60809 18.0352 2.59997 18.0718C2.59185 18.1083 2.59109 18.1461 2.59775 18.1829C2.60441 18.2197 2.61835 18.2548 2.63876 18.2862C2.80751 18.5567 2.98901 18.8237 3.17988 19.0799C3.20196 19.1095 3.22965 19.1345 3.26138 19.1534C3.29311 19.1723 3.32825 19.1848 3.36481 19.1901C3.40136 19.1955 3.43861 19.1935 3.47442 19.1845C3.51024 19.1754 3.54392 19.1594 3.57354 19.1373C3.60316 19.1153 3.62814 19.0876 3.64706 19.0558C3.66598 19.0241 3.67846 18.989 3.6838 18.9524C3.68914 18.9159 3.68722 18.8786 3.67816 18.8428C3.6691 18.807 3.65308 18.7733 3.63101 18.7437C3.44988 18.4992 3.27644 18.2455 3.11632 17.9892Z" fill="#0156FF"/>
<path d="M6.26252 21.2541C6.01108 21.0842 5.76377 20.902 5.52733 20.7115C5.49855 20.6883 5.46549 20.6711 5.43004 20.6607C5.39459 20.6504 5.35744 20.6471 5.32072 20.6511C5.284 20.655 5.24843 20.6662 5.21603 20.684C5.18363 20.7017 5.15504 20.7256 5.1319 20.7544C5.10875 20.7832 5.0915 20.8163 5.08113 20.8517C5.07076 20.8872 5.06748 20.9243 5.07147 20.961C5.07545 20.9978 5.08664 21.0333 5.10437 21.0657C5.12211 21.0981 5.14605 21.1267 5.17483 21.1499C5.42346 21.3497 5.68333 21.5419 5.94808 21.7202C6.00981 21.762 6.08559 21.7776 6.15879 21.7635C6.23198 21.7495 6.29661 21.7069 6.33846 21.6452C6.35921 21.6146 6.37372 21.5801 6.38114 21.5439C6.38855 21.5076 6.38874 21.4702 6.38169 21.4339C6.37463 21.3976 6.36047 21.363 6.34002 21.3321C6.31957 21.3013 6.29324 21.2748 6.26252 21.2541Z" fill="#0156FF"/>
<path d="M4.20691 19.4512C4.15746 19.3954 4.08784 19.3615 4.01339 19.357C3.93893 19.3524 3.86572 19.3777 3.80988 19.4271C3.75403 19.4766 3.72012 19.5462 3.7156 19.6207C3.71109 19.6951 3.73633 19.7683 3.78579 19.8242C3.99785 20.0634 4.22229 20.2961 4.45272 20.5161C4.47921 20.5427 4.51076 20.5637 4.54551 20.578C4.58026 20.5922 4.61752 20.5993 4.65507 20.5989C4.69262 20.5986 4.72972 20.5906 4.76416 20.5757C4.79861 20.5607 4.82971 20.539 4.85564 20.5118C4.88156 20.4847 4.90178 20.4526 4.9151 20.4175C4.92842 20.3823 4.93457 20.3449 4.93319 20.3074C4.93181 20.2699 4.92293 20.233 4.90707 20.1989C4.89121 20.1649 4.8687 20.1344 4.84085 20.1092C4.62166 19.8996 4.40847 19.6781 4.20691 19.4512Z" fill="#0156FF"/>
<path d="M12.2971 0.926758C10.4742 0.928543 8.67841 1.36788 7.06061 2.20784C5.44281 3.0478 4.05028 4.26384 3.00006 5.75376C2.9571 5.81475 2.94012 5.89031 2.95287 5.96382C2.96561 6.03732 3.00704 6.10276 3.06803 6.14572C3.12902 6.18869 3.20458 6.20567 3.27809 6.19292C3.3516 6.18017 3.41704 6.13875 3.46 6.07776C4.63938 4.40275 6.27083 3.09771 8.16394 2.31496C10.0571 1.5322 12.1338 1.30401 14.1517 1.65701C16.1696 2.01001 18.0455 2.92965 19.5604 4.30859C21.0754 5.68754 22.1669 7.46891 22.7076 9.44483C23.2484 11.4207 23.2159 13.5097 22.6142 15.4679C22.0124 17.426 20.8662 19.1727 19.3092 20.504C17.7522 21.8353 15.8486 22.6963 13.8207 22.9865C11.7929 23.2767 9.72423 22.9842 7.85631 22.1431C7.58069 22.0186 7.30619 21.8806 7.04069 21.7321C7.00843 21.7138 6.97286 21.702 6.93603 21.6975C6.8992 21.693 6.86184 21.6958 6.8261 21.7058C6.79036 21.7158 6.75695 21.7327 6.7278 21.7557C6.69864 21.7786 6.67432 21.8071 6.65622 21.8395C6.63812 21.8719 6.62662 21.9076 6.62236 21.9444C6.61811 21.9813 6.62119 22.0186 6.63143 22.0543C6.64167 22.0899 6.65886 22.1232 6.68202 22.1522C6.70518 22.1812 6.73385 22.2053 6.76638 22.2232C7.04594 22.3792 7.33469 22.5249 7.62494 22.6557C9.17056 23.3524 10.8524 23.6944 12.5474 23.6568C14.2423 23.6192 15.9074 23.203 17.4206 22.4385C18.9338 21.6741 20.2569 20.5808 21.2929 19.2388C22.3288 17.8968 23.0515 16.34 23.4079 14.6826C23.7642 13.0251 23.7453 11.3089 23.3525 9.65967C22.9597 8.01045 22.203 6.46998 21.1377 5.15111C20.0724 3.83224 18.7256 2.76837 17.1959 2.03744C15.6662 1.3065 13.9924 0.927006 12.2971 0.926758Z" fill="#0156FF"/>
<path d="M2.31293 6.21507C2.32925 6.31641 2.36538 6.41355 2.41925 6.50094C2.47311 6.58833 2.54366 6.66425 2.62687 6.72437C2.71008 6.78449 2.80431 6.82763 2.90419 6.85133C3.00407 6.87503 3.10764 6.87883 3.20899 6.8625L4.66174 6.6285C4.73383 6.61501 4.7978 6.57389 4.84001 6.51391C4.88222 6.45393 4.89933 6.37983 4.88769 6.30741C4.87605 6.235 4.83658 6.16999 4.7777 6.12626C4.71882 6.08253 4.64518 6.06353 4.57249 6.07331L3.11974 6.30788C3.06231 6.31692 3.00364 6.3029 2.95651 6.26886C2.90937 6.23483 2.8776 6.18355 2.86812 6.12619L2.63412 4.67287C2.62063 4.60078 2.5795 4.53681 2.51952 4.4946C2.45954 4.45239 2.38544 4.43528 2.31303 4.44693C2.24061 4.45857 2.17561 4.49804 2.13188 4.55692C2.08815 4.6158 2.06915 4.68944 2.07893 4.76212L2.31293 6.21507Z" fill="#0156FF"/>
<path d="M7.51695 8.9449C7.5282 8.93833 7.53889 8.93083 7.5507 8.92483L14.7601 5.27608H14.7619L12.5963 4.13421C12.507 4.08711 12.4076 4.0625 12.3066 4.0625C12.2057 4.0625 12.1062 4.08711 12.0169 4.13421L5.18258 7.73608C5.17395 7.74058 5.16645 7.74621 5.1582 7.75108L7.51695 8.9449Z" fill="#0156FF"/>
<path d="M9.73267 10.0664L12.1529 11.2915C12.2005 11.3155 12.2531 11.328 12.3064 11.328C12.3597 11.328 12.4122 11.3155 12.4599 11.2915L19.4547 7.75117C19.4465 7.7463 19.439 7.74067 19.4305 7.73617L16.9312 6.41992L9.76679 10.0462C9.75479 10.0522 9.7441 10.0599 9.73267 10.0664Z" fill="#0156FF"/>
<path d="M12.7142 11.7933C12.6733 11.8136 12.6309 11.8307 12.5874 11.8445V20.4507C12.5902 20.4492 12.5934 20.4489 12.5962 20.4474L19.4306 16.8474C19.53 16.7941 19.6132 16.7148 19.6713 16.6181C19.7294 16.5214 19.7602 16.4108 19.7606 16.298V8.28574C19.7606 8.26699 19.7583 8.24824 19.7567 8.22949L12.7142 11.7933Z" fill="#0156FF"/>
<path d="M12.0249 11.8446C11.9816 11.831 11.9395 11.8139 11.8989 11.7936L9.42971 10.544C9.42783 10.5627 9.42558 10.5815 9.42558 10.6017V13.8155C9.42558 13.8774 9.40702 13.9379 9.37229 13.9892C9.33757 14.0405 9.28827 14.0802 9.23075 14.1032C9.17324 14.1262 9.11015 14.1315 9.04963 14.1183C8.98911 14.1051 8.93393 14.0741 8.89121 14.0292L8.27621 13.388C8.23985 13.3494 8.19419 13.3209 8.14361 13.3052C8.09304 13.2894 8.03927 13.2869 7.98746 13.298L7.58621 13.3842C7.54083 13.3942 7.4938 13.3938 7.44857 13.3832C7.40335 13.3725 7.36109 13.3519 7.32492 13.3227C7.28874 13.2936 7.25958 13.2567 7.23957 13.2147C7.21957 13.1728 7.20924 13.1269 7.20933 13.0805V9.47858C7.20933 9.45983 7.21158 9.44108 7.21327 9.42233L4.85452 8.22852C4.85284 8.24727 4.85059 8.26602 4.85059 8.28627V16.2979C4.85093 16.411 4.88199 16.5218 4.94045 16.6186C4.9989 16.7154 5.08255 16.7944 5.18246 16.8473L12.0168 20.4473C12.0195 20.4486 12.0223 20.449 12.0249 20.4503V11.8446Z" fill="#0156FF"/>
</svg>

                                    </div>
                                </div>
                            </div>
                                </div>
                                                             <!-- Third Servive -->
                            <div class="mt-2 border border-[#CACDD8] rounded-[6px]">
                                <div class="flex flex-col items-end p-4">
                                <div class="flex flex-row justify-end items-center w-full">
                                    <div class="text-right cursor-pointer w-full">
                                        <div class="flex flex-row-reverse items-center justify-between w-full">
                                        <h3 class="text-[#171515] text-[12px] md:text-[16px]  font-FlatBold  "> المسؤولية </h3>
                                         <svg class="duration-300" xmlns="http://www.w3.org/2000/svg" width="12"
                                            height="11" viewBox="0 0 17 11" fill="none">
                                            <path
                                                d="M16.1799 10.1577H0.820002C0.0931492 10.1577 -0.277135 9.28 0.244006 8.75885L7.92396 1.07883C8.23939 0.763406 8.76053 0.763406 9.07609 1.07883L16.7561 8.75885C17.2771 9.28 16.9068 10.1577 16.1799 10.1577Z"
                                                fill="#201A3C" />
                                        </svg>
                                        </div>
                                        <h6 class="hidden text-[#313131] text-[14px] text-right font-Flatnormal">
                                            تاريخ سريع مجاني للطلبات أكثر من تاريخ التوصيل المحتمل في 13-04-2022

                                        </h6>
                                    </div>
                                    <div>
<svg class="ml-2" width="18" height="21" viewBox="0 0 22 25" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M4.69409 7.85906C4.78897 8.99404 5.00684 10.5487 5.49982 12.1812C6.54682 15.6479 8.39641 18.1129 11.0001 19.5137C13.6037 18.1129 15.4533 15.6479 16.5003 12.1812C16.9933 10.5489 17.2111 8.99413 17.3061 7.85906L11.0001 4.70605L4.69409 7.85906Z" fill="#0156FF"/>
<path d="M21.5869 5.6812C21.5738 5.42835 21.4257 5.20209 21.1992 5.08889L11.3144 0.14648C11.1165 0.0475273 10.8835 0.0475273 10.6856 0.14648L0.800788 5.08889C0.574335 5.20209 0.42621 5.42835 0.413085 5.6812C0.405585 5.8251 0.243022 9.25157 1.41026 13.2297C2.10091 15.5835 3.11679 17.6393 4.42966 19.3401C6.08412 21.4833 8.21055 23.0599 10.7499 24.0263C10.8305 24.0569 10.9152 24.0722 11 24.0722C11.0848 24.0722 11.1695 24.0569 11.2501 24.0263C13.7894 23.06 15.9159 21.4833 17.5703 19.3401C18.8832 17.6393 19.8991 15.5834 20.5897 13.2297C21.757 9.25157 21.5944 5.8251 21.5869 5.6812V5.6812ZM11.3116 20.935C11.2134 20.9835 11.1067 21.0078 11 21.0078C10.8933 21.0078 10.7865 20.9835 10.6884 20.935C7.55749 19.387 5.35887 16.5785 4.15362 12.5877C3.5508 10.5916 3.33316 8.71068 3.25676 7.48434C3.23918 7.20271 3.39171 6.93792 3.64409 6.81173L10.6856 3.291C10.8836 3.19209 11.1165 3.19204 11.3145 3.291L18.356 6.81173C18.6084 6.93787 18.7609 7.20276 18.7434 7.48438C18.6669 8.71082 18.4493 10.5918 17.8465 12.5877C16.6411 16.5785 14.4425 19.3869 11.3116 20.935V20.935Z" fill="#0156FF"/>
</svg>


                                    </div>
                                </div>
                            </div>
                                </div>
            </div>

        </div>
        <!-- last Section -->

            <!-- {{-- Our Product --}} -->

    <div class="bg-white">
        <div class="py-16 sm:py-20 xl:max-w-7xl xl:mx-auto px-8 xl:px-8">
          <div class="flex flex-row-reverse justify-between items-center container mx-auto lg:px-0">
            <a href="#" class="md:text-[18px] lg:text-[24px] xl:text-[30px]  font-FlatBold text-[#000000]"
              >  منتجات متشابهة</a
            >
            <a
              href="#"
              class="text-[#0156FF] text-[16px] font-Flatnormal underline"
            >
              شاهد جميع المنتجات
            </a>
          </div>

          <div class="mt-8 relative">
            <div class="relative w-full pb-6 -mb-6 ">
                <ul
                role="list"
                class="mx-4  space-x-8 sm:mx-6 xl:mx-0 xl:space-x-0 xl:grid xl:grid-cols-4 xl:gap-x-8 lg:grid-cols-3  flex flex-wrap-reverse sm:flex-wrap justify-center items-center ">
                <li class="min-w-[290px] max-w-[300px] flex flex-col text-center xl:w-auto drop-shadow-xl rounded-[10px] border-[1.5px] border-[#F9F8F8] m-10 lg:m-0">
                  <div class="group relative">
                    <div
                      class="
                        flex flex-row-reverse items-start justify-between w-full px-4  py-4">
                      <p class="text-[#29A71A] text-[12px] font-FlatBold">متوفر</p>
                      <!-- src="{{asset('assets/front-end/img/AppelCharger.png')}}"  -->
                      <img src="../../assets/Icons/AppelCharger.png"
                      alt="iphone" class="h-[150px] w-[150px]"/>
                       <!-- src="{{asset('assets/front-end/img/FavouriteIcon.svg')}}" -->
                      <img
                      src="../../assets/Icons/FavouriteIcon.svg"
                       alt="favourite"/>
                    </div>
                    <div
                      class="flex flex-row-reverse items-center justify-start mt-7 px-4">
                      <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
                      <img
                      src="../../assets/Icons/star.svg"
                       alt="star" class="h-[13px] w-[13px]"/>
                      <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
                      <img
                      src="../../assets/Icons/star.svg"
                       alt="star" class="h-[13px] w-[13px]"/>
                      <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
                      <img
                      src="../../assets/Icons/star.svg"
                       alt="star" class="h-[13px] w-[13px]"/>
                      <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
                      <img
                      src="../../assets/Icons/star.svg"
                       alt="star" class="h-[13px] w-[13px]"/>
                      <!-- src="{{asset('assets/front-end/img/UnColorStar.svg')}}" -->
                      <img
                      src="../../assets/Icons/UnColorStar.svg"
                       alt="star" class="h-[13px] w-[13px]"/>
                      <p dir="rtl" class="text-[#A2A6B0] font-Flatnormal text-[12px]">
                        التقيمات(4)
                      </p>
                    </div>
                    <p class="font-Poppins text-[13px] mt-2 text-right px-4">iPhone 13 Pro & iPhone 13 Pro Max </p>
                    <p
                      dir="rtl"
                      class=" font-Flatnormal text-[#171515] text-right text-[12px] mt-2 px-4">
                      اكبر ترقية على الأطلاق يشهدها نظام كاميرات 6.1 انش ليساهم في
                      superRatio XDR شاشة 6.1انش
                    </p>
                    <p
                      class="font-Poppins text-[14px] text-[#666666] mt-2 text-right relative mx-4" >
                      ₪499.00
                      <span
                        class="absolute border-b w-10 border-[#666666] top-2.5 right-0.5 px-4"
                      ></span>
                    </p>
                    <p
                      class="
                        font-FlatBold text-[16px] text-[#171515] text-right relative px-4">
                      ₪499.00
                    </p>
                    <div
                      class="flex flex-row-reverse items-center justify-start my-2"
                    >
                      <button
                        type="button"
                        class=" inline-flex items-center px-7 py-3 mt-2 text-[14px] font-FlatBold rounded-[30px] text-white bg-[#0156FF] hover:bg-black hover:text-white "
                      >
                        اشتري الأن
                      </button>
                      <button
                        type="button"
                        class="inline-flex items-center px-4 mx-1 py-3 mt-2 border border-[#0156FF] text-[14px] font-FlatBold rounded-[30px] text-[#0156FF] bg-white hover:text-white hover:bg- addtoCart" >
                        أضف الى الحقيبة
                      </button>
                    </div>
                  </div>
                </li>
  <!-- {{-- second Products --}} -->
  <li class="min-w-[290px] max-w-[300px] inline-flex flex-col text-center xl:w-auto drop-shadow-xl rounded-[10px] border-[1.5px] border-[#F9F8F8] m-10 lg:m-0">
    <div class="group relative">
      <div
        class="
          flex flex-row-reverse items-start justify-between w-full px-4  py-4">
        <p class="text-[#29A71A] text-[12px] font-FlatBold">متوفر</p>
         <!-- src="{{asset('assets/front-end/img/OurProductMac2.png')  }}" -->
        <img
        src="../../assets/Icons/OurProductMac2.png"
          alt="iphone" class="h-[150px] w-[150px]"/>
         <!-- src="{{asset('assets/front-end/img/FavouriteIcon.svg')}}" -->
        <img
        src="../../assets/Icons/FavouriteIcon.svg"
         alt="favourite"/>
      </div>
      <div
        class="flex flex-row-reverse items-center justify-start mt-7 px-4">
        <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
        <img
        src="../../assets/Icons/star.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
        <img
        src="../../assets/Icons/star.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
        <img
        src="../../assets/Icons/star.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
        <img
        src="../../assets/Icons/star.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <!-- src="{{asset('assets/front-end/img/UnColorStar.svg')}}" -->
        <img
        src="../../assets/Icons/UnColorStar.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <p dir="rtl" class="text-[#A2A6B0] font-Flatnormal text-[12px]">
          التقيمات(4)
        </p>
      </div>
      <p class="font-Poppins text-[13px] mt-2 text-right px-4">iPhone 13 Pro & iPhone 13 Pro Max </p>
      <p
        dir="rtl"
        class=" font-Flatnormal text-[#171515] text-right text-[12px] mt-2 px-4">
        اكبر ترقية على الأطلاق يشهدها نظام كاميرات 6.1 انش ليساهم في
        superRatio XDR شاشة 6.1انش
      </p>
      <p
        class="font-Poppins text-[14px] text-[#666666] mt-2 text-right relative mx-4" >
        ₪499.00
        <span
          class="absolute border-b w-10 border-[#666666] top-2.5 right-0.5 px-4"
        ></span>
      </p>
      <p
        class="
          font-FlatBold text-[16px] text-[#171515] text-right relative px-4">
        ₪499.00
      </p>
      <div
        class="flex flex-row-reverse items-center justify-start my-2"
      >
        <button
          type="button"
          class=" inline-flex items-center px-7 py-3 mt-2 text-[14px] font-FlatBold rounded-[30px] text-white bg-[#0156FF] hover:bg-black hover:text-white "
        >
          اشتري الأن
        </button>
        <button
          type="button"
          class="inline-flex items-center px-4 mx-1 py-3 mt-2 border border-[#0156FF] text-[14px] font-FlatBold rounded-[30px] text-[#0156FF] bg-white hover:text-white hover:bg- addtoCart" >
          أضف الى الحقيبة
        </button>
      </div>
    </div>
  </li>

  <!-- {{-- third Product --}} -->

  <li class="min-w-[290px] max-w-[300px] inline-flex flex-col text-center xl:w-auto drop-shadow-xl rounded-[10px] border-[1.5px] border-[#F9F8F8] m-10 lg:m-0">
    <div class="group relative">
      <div
        class="
          flex flex-row-reverse items-start justify-between w-full px-4  py-4">
        <p class="text-[#29A71A] text-[12px] font-FlatBold">متوفر</p>
         <!-- src="{{asset('assets/front-end/img/AirBod.png')}}" -->
        <img
        src="../../assets/Icons/AirBod.png"
         alt="iphone" class="h-[150px] w-[150px]"/>
         <!-- src="{{asset('assets/front-end/img/FavouriteIcon.svg')}}" -->
        <img
        src="../../assets/Icons/FavouriteIcon.svg"
         alt="favourite"/>
      </div>
      <div
        class="flex flex-row-reverse items-center justify-start mt-7 px-4">
        <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
        <img
        src="../../assets/Icons/star.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
        <img
        src="../../assets/Icons/star.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
        <img
        src="../../assets/Icons/star.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
        <img
        src="../../assets/Icons/star.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <!-- src="{{asset('assets/front-end/img/UnColorStar.svg')}}" -->
        <img
        src="../../assets/Icons/UnColorStar.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <p dir="rtl" class="text-[#A2A6B0] font-Flatnormal text-[12px]">
          التقيمات(4)
        </p>
      </div>
      <p class="font-Poppins text-[13px] mt-2 text-right px-4">iPhone 13 Pro & iPhone 13 Pro Max </p>
      <p
        dir="rtl"
        class=" font-Flatnormal text-[#171515] text-right text-[12px] mt-2 px-4">
        اكبر ترقية على الأطلاق يشهدها نظام كاميرات 6.1 انش ليساهم في
        superRatio XDR شاشة 6.1انش
      </p>
      <p
        class="font-Poppins text-[14px] text-[#666666] mt-2 text-right relative mx-4" >
        ₪499.00
        <span
          class="absolute border-b w-10 border-[#666666] top-2.5 right-0.5 px-4"
        ></span>
      </p>
      <p
        class="
          font-FlatBold text-[16px] text-[#171515] text-right relative px-4">
        ₪499.00
      </p>
      <div
        class="flex flex-row-reverse items-center justify-start my-2"
      >
        <button
          type="button"
          class=" inline-flex items-center px-7 py-3 mt-2 text-[14px] font-FlatBold rounded-[30px] text-white bg-[#0156FF] hover:bg-black hover:text-white "
        >
          اشتري الأن
        </button>
        <button
          type="button"
          class="inline-flex items-center px-4 mx-1 py-3 mt-2 border border-[#0156FF] text-[14px] font-FlatBold rounded-[30px] text-[#0156FF] bg-white hover:text-white hover:bg- addtoCart" >
          أضف الى الحقيبة
        </button>
      </div>
    </div>
  </li>

  <!-- {{-- fourth Products --}} -->

  <li class="min-w-[290px] max-w-[300px] inline-flex flex-col text-center xl:w-auto drop-shadow-xl rounded-[10px] border-[1.5px] border-[#F9F8F8] m-10 lg:m-0">
    <div class="group relative">
      <div
        class="
          flex flex-row-reverse items-start justify-between w-full px-4  py-4">
        <p class="text-[#29A71A] text-[12px] font-FlatBold">متوفر</p>
         <!-- src="{{asset('assets/front-end/img/iphoneProduct.png')}}" -->
        <img
        src="../../assets/Icons/iphoneProduct.png"
         alt="iphone" class="h-[150px] w-[150px]"/>
         <!-- src="{{asset('assets/front-end/img/FavouriteIcon.svg')}}" -->
        <img
        src="../../assets/Icons/FavouriteIcon.svg"
         alt="favourite"/>
      </div>
      <div
        class="flex flex-row-reverse items-center justify-start mt-7 px-4">
        <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
        <img
        src="../../assets/Icons/star.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
        <img
        src="../../assets/Icons/star.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
        <img
        src="../../assets/Icons/star.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <!-- src="{{asset('assets/front-end/img/star.svg')}}" -->
        <img
        src="../../assets/Icons/star.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <!-- src="{{asset('assets/front-end/img/UnColorStar.svg')}}" -->
        <img
        src="../../assets/Icons/UnColorStar.svg"
         alt="star" class="h-[13px] w-[13px]"/>
        <p dir="rtl" class="text-[#A2A6B0] font-Flatnormal text-[12px]">
          التقيمات(4)
        </p>
      </div>
      <p class="font-Poppins text-[13px] mt-2 text-right px-4">iPhone 13 Pro & iPhone 13 Pro Max </p>
      <p
        dir="rtl"
        class=" font-Flatnormal text-[#171515] text-right text-[12px] mt-2 px-4">
        اكبر ترقية على الأطلاق يشهدها نظام كاميرات 6.1 انش ليساهم في
        superRatio XDR شاشة 6.1انش
      </p>
      <p
        class="font-Poppins text-[14px] text-[#666666] mt-2 text-right relative mx-4" >
        ₪499.00
        <span
          class="absolute border-b w-10 border-[#666666] top-2.5 right-0.5 px-4"
        ></span>
      </p>
      <p
        class="
          font-FlatBold text-[16px] text-[#171515] text-right relative px-4">
        ₪499.00
      </p>
      <div
        class="flex flex-row-reverse items-center justify-start my-2"
      >
        <button
          type="button"
          class=" inline-flex items-center px-7 py-3 mt-2 text-[14px] font-FlatBold rounded-[30px] text-white bg-[#0156FF] hover:bg-black hover:text-white "
        >
          اشتري الأن
        </button>
        <button
          type="button"
          class="inline-flex items-center px-4 mx-1 py-3 mt-2 border border-[#0156FF] text-[14px] font-FlatBold rounded-[30px] text-[#0156FF] bg-white hover:text-white hover:bg- addtoCart" >
          أضف الى الحقيبة
        </button>
      </div>
    </div>
  </li>
  </ul>
    </div>
          </div>


        </div>
      </div>
        </div>
     </div>
</template>